#+title: Kitchen Planner

A CLI tool for modelling kitchen resources, recipes, and cooks, then
generating optimized cooking schedules via constraint programming.

* Status

Completed schemas for kitchen, recipe, cook, and plan (JSON via ~serde~).

MiniZinc-based solver produces optimized schedules with:
- Dependency chain enforcement
- Resource contention avoidance (same equipment)
- Cook contention avoidance (oven tasks exempt)
- Recipe end-time alignment via weighted objective
- Skill-adaptive durations: cooks are assigned to tasks matching their skill
  level, and effective durations are picked from =duration_by_skill=

Two renderers (text terminal, client-side web app).

Sample schedule (Lasagna + Garlic Bread, 4 cooks, ~data/~):

#+begin_src fish :results raw
  just run \
    --kitchen data/kitchens/simple.ron \
    --cook data/cooks/alice.ron \
    --cook data/cooks/bob.ron \
    --cook data/cooks/charlie.ron \
    --cook data/cooks/diana.ron \
    data/recipes/*.ron
#+end_src

#+RESULTS:
Kitchen Planner - Gantt Chart

Duration                                 в”Ӯ Dish         в”Ӯ Task                                   в”Ӯ Deps           в”Ӯ Cook       в”Ӯ Resource
в”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җ в”ј в”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җ в”ј в”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җ в”ј в”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җ в”ј в”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җ в”ј в”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җв”Җ
  0вҖ“7   в–“в–“в–“                              в”Ӯ Lasagna      в”Ӯ Dice onion and garlic                  в”Ӯ                в”Ӯ Diana      в”Ӯ prep_surface (Island Counter)
  0вҖ“10  в–“в–“в–“в–“                             в”Ӯ Lasagna      в”Ӯ Brown ground beef                      в”Ӯ                в”Ӯ Bob        в”Ӯ burner (Back Right Burner)
  0вҖ“7   в–“в–“в–“                              в”Ӯ Mashed PotatвҖҰ в”Ӯ Peel and chop potatoes                 в”Ӯ                в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)
     7вҖ“12  в–“в–“                            в”Ӯ Lasagna      в”Ӯ SautГ© onion and garlic                 в”Ӯ s1             в”Ӯ Alice      в”Ӯ burner (Back Left Burner)
     7вҖ“32  в–“в–“в–“в–“в–“в–“в–“в–“в–“в–“                    в”Ӯ Mashed PotatвҖҰ в”Ӯ Boil potatoes in salted water          в”Ӯ s1             в”Ӯ Charlie    в”Ӯ burner (Front Left Burner)
      12вҖ“32  в–“в–“в–“в–“в–“в–“в–“в–“                    в”Ӯ Lasagna      в”Ӯ Simmer tomato sauce with beef and oвҖҰ   в”Ӯ s2, s3         в”Ӯ Alice      в”Ӯ burner (Back Left Burner)
      13вҖ“31  в–“в–“в–“в–“в–“в–“в–“                     в”Ӯ Garlic Bread в”Ӯ Pre-heat oven to 200В°C                 в”Ӯ                в”Ӯ (none)     в”Ӯ oven (Main Oven)
              31вҖ“47  в–“в–“в–“в–“в–“в–“в–“             в”Ӯ Lasagna      в”Ӯ Pre-heat oven to 180В°C                 в”Ӯ                в”Ӯ (none)     в”Ӯ oven (Main Oven)
              32вҖ“47  в–“в–“в–“в–“в–“в–“              в”Ӯ Lasagna      в”Ӯ Layer lasagna in baking dish           в”Ӯ s4             в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)
                    47вҖ“51  в–“в–“            в”Ӯ Garlic Bread в”Ӯ Mince garlic and chop parsley          в”Ӯ                в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)
                    47вҖ“87  в–“в–“в–“в–“в–“в–“в–“в–“в–“в–“в–“   в”Ӯ Lasagna      в”Ӯ Bake lasagna                           в”Ӯ s5, s6.preheat в”Ӯ (none)     в”Ӯ oven (Main Oven)
                      51вҖ“54  в–“           в”Ӯ Garlic Bread в”Ӯ Mix butter with garlic and parsley     в”Ӯ s1             в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)
                       54вҖ“56  в–“          в”Ӯ Mashed PotatвҖҰ в”Ӯ Drain potatoes                         в”Ӯ s2             в”Ӯ Alice      в”Ӯ sink (Kitchen Sink)
                        56вҖ“61  в–“в–“        в”Ӯ Mashed PotatвҖҰ в”Ӯ Mash with butter and milk              в”Ӯ s3             в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)
                          61вҖ“66  в–“в–“      в”Ӯ Garlic Bread в”Ӯ Slice baguette and spread garlic buвҖҰ   в”Ӯ s2             в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)
                              87вҖ“97  в–“   в”Ӯ Garlic Bread в”Ӯ Bake in oven                           в”Ӯ s3, s4.preheat в”Ӯ (none)     в”Ӯ oven (Main Oven)
                              87вҖ“97  в–“   в”Ӯ Lasagna      в”Ӯ Rest before serving                    в”Ӯ s6             в”Ӯ (none)     в”Ӯ (none)
                              95вҖ“97  в–“   в”Ӯ Mashed PotatвҖҰ в”Ӯ Season to taste                        в”Ӯ s4             в”Ӯ Alice      в”Ӯ prep_surface (Main Counter)

